PedroFnseca/esp32-http-client/tests/test_rest_request.cpp
  StringStream stream(largeData);
  BufferedStreamReader reader(&stream, false);
  req.parseResponse(reader);
  
  expectEq(buf, "found", "should successfully read beyond 512 bytes buffer size in parseResponse");
  req._executed = true;
}

void testMoreParseEdgeCases() {
  ESP32HTTPClient client("https://example.com");
  RestRequest req(&client, "/edge", HTTP_GET_METHOD);

  bool active = true;
  String strVal;
  long lval = 0;
  char charbuf[10] = {0};

  req.getBody("active", &active)
     .getBody("strVal", &strVal)
     .getBody("lval", &lval)
     .getBody("charbuf", charbuf, sizeof(charbuf));

  StringStream stream(R"({"active":false,"strVal":"hello","lval":-12345,"charbuf":"1234567890123","ignore_arr":[1,2,3],"ignore_obj":{"a":1}})");
  BufferedStreamReader reader(&stream);
  req.parseResponse(reader);

  expectTrue(!active, "boolean false should be parsed");
  expectEq(strVal.str(), "hello", "arduino string should be parsed");
  expectEqInt(lval, -12345, "negative long should be parsed");
  expectEq(charbuf, "123456789", "char buffer should be truncated to max length");
  req._executed = true;
}

void testParseEmptyObjectOrArray() {
  ESP32HTTPClient client("https://example.com");
  RestRequest req(&client, "/empty", HTTP_GET_METHOD);

  int x = 10;
  req.getBody("x", &x);

  StringStream stream(R"({})");
  BufferedStreamReader reader1(&stream);
  req.parseResponse(reader1);
  expectEqInt(x, 10, "empty object shouldn't crash");

  StringStream stream2(R"([])");
  BufferedStreamReader reader2(&stream2);
  req.parseResponse(reader2);
  expectEqInt(x, 10, "empty array shouldn't crash");
  
  req._executed = true;
}

void testAddParamAdvanced() {
  ESP32HTTPClient client("https://example.com");
  RestRequest req(&client, "/test", HTTP_GET_METHOD);
  
  req.query("d", 3.14159265);
  req.body("f", 2.5f);
  
  expectEqInt((long long)req._queryParams.size(), 1, "query params size");
  expectEqInt((long long)req._bodyParams.size(), 1, "body params size");
  
  expectEq(req._queryParams[0].valueBuffer, "3.14159265", "double formatting");
  expectEq(req._bodyParams[0].valueBuffer, "2.5", "float formatting");
  req._executed = true;
}

void testExecuteCustomPortWithPath() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "{}");
  ESP32HTTPClient client("http://test.com/api", 8080);
  client.get("/data").getBody("x", (int*)nullptr);
  
  expectEq(HttpClientStub::lastUrl, "http://test.com:8080/api/data", "port injection with path");
}

void testParseEscapedStringsSimple() {
  ESP32HTTPClient client("https://example.com");
  RestRequest req(&client, "/edge", HTTP_GET_METHOD);
  char buf[32] = {0};
  req.getBody("escaped", buf, sizeof(buf));
  StringStream stream(R"({"escaped":"a\"b\\c"})");
  BufferedStreamReader reader(&stream);
  req.parseResponse(reader);
  expectEq(buf, "a\"b\\c", "escaped char buffer");
  req._executed = true;
}

void testSkipValueAdvanced() {
  ESP32HTTPClient client("https://example.com");
  RestRequest req(&client, "/skip", HTTP_GET_METHOD);

  int x = 0;
  req.getBody("x", &x);

  StringStream stream(R"({"skip_obj":{"a":"b\"c", "d":[1,2,{"e":"f"}]},"skip_arr":[1,"[","]",{"x":"y"}],"x":42})");
  BufferedStreamReader reader(&stream);
  req.parseResponse(reader);

  expectEqInt(x, 42, "x should be parsed after skipping complex structures");
  req._executed = true;
}

void testMoveConstructor() {
  ESP32HTTPClient client("https://example.com");
  RestRequest req1(&client, "/move", HTTP_GET_METHOD);
  req1.query("a", 1);
  
  RestRequest req2(std::move(req1));
  
  expectTrue(req1._executed, "req1 should be marked executed after move");
  expectEqInt((long long)req2._queryParams.size(), 1, "req2 should have params");
  req2._executed = true;
}

void testParsePrimitiveTypes() {
  ESP32HTTPClient client("https://example.com");
  RestRequest req(&client, "/prim", HTTP_GET_METHOD);
  
  double dVal = 0.0;
  String bStr;
  
  req.getBody("dVal", &dVal)
     .getBody("bStr", &bStr);
     
  StringStream stream(R"({"dVal":3.1415926535,"bStr":true})");
  BufferedStreamReader reader(&stream);
  req.parseResponse(reader);
  
  expectNear(dVal, 3.1415926535, 0.000001, "double precision parsing");
  expectEq(bStr.str(), "true", "boolean to String parsing");
  req._executed = true;
}

void testAuthBearer() {
  HttpClientStub::reset();
  ESP32HTTPClient client("https://example.com");
  client.bearer("eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9");

  expectEqInt(static_cast<long long>(client._headers.size()), 1, "headers size after bearer");
  expectEq(client._headers[0].name, "Authorization", "header name should be Authorization");
  expectEq(client._headers[0].value, "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9", "bearer token format");

  int id = 0;
  client.get("/secure").getBody("id", &id);

  bool found = false;
  for (const auto& h : HttpClientStub::lastHeaders) {
    if (h.first == "Authorization" && h.second == "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9") {
      found = true;
      break;
    }
  }
  expectTrue(found, "Authorization header should be sent with request");

  client.bearer("new-token-456");
  expectEqInt(static_cast<long long>(client._headers.size()), 1, "bearer overwrite should not duplicate header");
  expectEq(client._headers[0].value, "Bearer new-token-456", "bearer header updated");
}

void testAuthBasic() {
  HttpClientStub::reset();
  ESP32HTTPClient client("https://example.com");
  client.basic("admin", "123456");

  expectEqInt(static_cast<long long>(client._headers.size()), 1, "headers size after basic");
  expectEq(client._headers[0].name, "Authorization", "header name should be Authorization");
  expectEq(client._headers[0].value, "Basic YWRtaW46MTIzNDU2", "basic auth encoding for admin:123456");

  int id = 0;
  client.get("/admin").getBody("id", &id);

  bool found = false;
  for (const auto& h : HttpClientStub::lastHeaders) {
    if (h.first == "Authorization" && h.second == "Basic YWRtaW46MTIzNDU2") {
      found = true;
      break;
    }
  }
  expectTrue(found, "Basic Authorization header should be sent with request");

  client.basic("user", "pass");
  expectEq(client._headers[0].value, "Basic dXNlcjpwYXNz", "basic auth encoding for user:pass");

  client.basic("Aladdin", "open sesame");
  expectEq(client._headers[0].value, "Basic QWxhZGRpbjpvcGVuIHNlc2FtZQ==", "basic auth encoding for Aladdin:open sesame");
}

void testAuthApiKey() {
  HttpClientStub::reset();
  ESP32HTTPClient client("https://example.com");
  client.apiKey("x-api-key", "secret-key-123");

  expectEqInt(static_cast<long long>(client._headers.size()), 1, "headers size after apiKey");
  expectEq(client._headers[0].name, "x-api-key", "api key header name");
  expectEq(client._headers[0].value, "secret-key-123", "api key header value");

  int val = 0;
  client.get("/api/v1").getBody("v", &val);

  bool found = false;
  for (const auto& h : HttpClientStub::lastHeaders) {
    if (h.first == "x-api-key" && h.second == "secret-key-123") {
      found = true;
      break;
    }
  }
  expectTrue(found, "API key header should be sent with request");

  client.apiKey("x-api-key", "new-secret-456");
  expectEqInt(static_cast<long long>(client._headers.size()), 1, "apiKey overwrite should not duplicate header");
  expectEq(client._headers[0].value, "new-secret-456", "apiKey header updated");
}

void testAuthEdgeCases() {
  ESP32HTTPClient client("https://example.com");
  client.bearer(nullptr);
  expectEq(client._headers[0].value, "Bearer ", "bearer with null token");

  client.basic(nullptr, nullptr);
  expectEq(client._headers[0].value, "Basic Og==", "basic with null creds");

